{"Author":"Brian Mavity","Content":"\u003cp\u003eAnd with that age old (relatively speaking) tradition of uselessness from the web, I open myself to the world.\u003c/p\u003e \r\n\u003ch3\u003eWhy a blog?\u003c/h3\u003e \r\n\u003cp\u003eI feel that developers need to have both strong oral and written communication skills. I decided that by making a \u003ca href=\"http://www.codinghorror.com/blog/archives/000983.html\"\u003ecommitment to blogging\u003c/a\u003e, I could reap what I consider to be major benefits.\u003c/p\u003e \r\n\u003cul\u003e \r\n    \u003cli\u003eImprove my writing skills by... writing\u003c/li\u003e \r\n    \u003cli\u003eImprove my level of knowledge by researching posts\u003c/li\u003e \r\n    \u003cli\u003eGet to know others in the community by providing informative posts\u003c/li\u003e \r\n    \u003cli\u003eImprove my development skills by interacting with others in the community\u003c/li\u003e \r\n\u003c/ul\u003e \r\n\u003ch3\u003eWhich way do I lean?\u003c/h3\u003e \r\n\u003cp\u003eNot like that... pervs! I am a .net developer, and I feel like our community can be broadly categorized into two camps. The first camp is data first, focusing on the database and having all code follow from there. The second is code first, focusing on an expressive Domain Model and Ubiquitous Language. Even though first camp is the vast majority, I fall into second. I consider myself an \u003ca href=\"http://altdotnet.org\"\u003ealt.net\u003c/a\u003e person. Since I first wandered along to a post about tdd, by \u003ca href=\"http://codebetter.com/blogs/jeremy.miller/default.aspx\"\u003eJeremy Miller\u003c/a\u003e, the alt.net set of core values have just made sense to me.\u003c/p\u003e \r\n\u003ch3\u003eWhat can you expect?\u003c/h3\u003e \r\n\u003cp\u003eMy current commitment to myself is to make one blog post a week. In the spirit of the \u003ca href=\"http://www.pragprog.com/\"\u003ePragmatic Programmers\u003c/a\u003e, I am learning a new language, \u003ca href=\"http://boo.codehaus.org/\"\u003eBoo\u003c/a\u003e. I hope to start contributing to the \u003ca href=\"http://github.com/olsonjeffery/boolangstudio/tree/master\"\u003eBooLangStudio\u003c/a\u003e project very soon. I am also very interested in \u003ca href=\"http://domaindrivendesign.org/\"\u003eDomain Driven Design\u003c/a\u003e, \u003ca href=\"http://behaviour-driven.org/\"\u003eBehavior Driven Development\u003c/a\u003e, \u003ca href=\"http://en.wikipedia.org/wiki/Interaction_design\"\u003eInteraction Design\u003c/a\u003e, \u003ca href=\"http://butunclebob.com/ArticleS.UncleBob.PrinciplesOfOod\"\u003eSOLID Object Oriented Principles\u003c/a\u003e, and \u003ca href=\"http://www.poppendieck.com/design.htm\"\u003eLean\u003c/a\u003e. Posts pertaining to these topics should find their way into this area some time soon.\u003c/p\u003e \r\n\u003ch3\u003eGet it over with already!\u003c/h3\u003e \r\n\u003cp\u003eI hope that readers can find my blog useful. I want to encourage anyone to email me (bmavity xxATxx brianmavity xxDOTxx com) with any questions or comments. I plan on learning throughout this experience, and extend an invitation to everyone else to \u003cem\u003elearn with me\u003c/em\u003e.\u003c/p\u003e \r\n\u003cp\u003e \r\n \r\n\u003c/p\u003e ","Title":"First!","PublishDate":"9/5/2008"}
{"Author":"Brian Mavity","Content":"\u003cp\u003eI am in Austin for \u003ca href=\"http://www.kaizenconf.com/\"\u003ekaizenconf\u003c/a\u003e. This would not be unusual in any respect except for the fact that I have never been to a software development conference. The closest I have come was \u003ca href=\"http://www.codeapalooza.com/\"\u003eCodeapalooza\u003c/a\u003e, but that was a one day event. What really stands out is the impact of being in the same room and discussing issues with \u003ca href=\"http://codebetter.com/blogs/jeremy.miller/default.aspx\"\u003ebloggers\u003c/a\u003e I \u003ca href=\"http://codebetter.com/blogs/david_laribee/default.aspx\"\u003eread\u003c/a\u003e and \u003ca href=\"http://ayende.com/Blog/\"\u003erespect\u003c/a\u003e. I\u0027m not gonna lie, it\u0027s still a bit intimidating.\u003c/p\u003e \r\n\u003cp\u003eIt\u0027s obvious even after one day that this trip will more than pay for itself with the insights that I will gain and the improvement to my skill set that will result. One of the things I really respect about \u003ca href=\"http://www.kaizenconf.com/\"\u003ekaizenconf\u003c/a\u003e is that nobody is trying to sell you the \u003ca href=\"http://microsoftpdc.com/\"\u003enext greatest thing\u003c/a\u003e. It\u0027s all about improving the craft along with the \u003ca href=\"http://en.wikipedia.org/wiki/Behavior_Driven_Development\"\u003etools\u003c/a\u003e and \u003ca href=\"http://codebetter.com/blogs/david_laribee/archive/2008/04/22/iterations-vs-flow.aspx\"\u003econcepts\u003c/a\u003e that will facilitate that improvement.\u003c/p\u003e \r\n\u003cp\u003eBut the truth of the matter is that the important part of the experience is the human interaction. I am convinced (yes, after one day) that conferences are essential to developer growth. I find it sad that not all companies subsidize conference attendance for their developers. It seems to me that if any company not offering this opportunity is tacitly admitting it is uninterested in investing in its developers.\u003c/p\u003e \r\n\u003ch3\u003eThe bottom line\u003c/h3\u003e \r\n\u003cp\u003eAs a software developer, I know there are often many legitimate reasons to stay with a company. However, if you are reading blogs then you are in the \u003ca href=\"http://www.codinghorror.com/blog/archives/001004.html\"\u003etop 20% of developers\u003c/a\u003e and you have earned an investment by caring deeply about your craft. Insist that your company invest in you, or find one that will. You are worth it.\u003c/p\u003e","Title":"I have lost my virginity (and you should too)","PublishDate":"10/30/2008"}
{"Author":"Brian Mavity","Content":"\u003cp\u003eIt\u0027s 2009, a new year, time for resolutions, end of the year blog lists, and future plan blog posts. I decided to share my resolutions in a blog post, but then I remembered that resolutions suck eggs (Yeah, I said eggs). This left me with a choice between some type of \u003ca href=\"http://www.lostechies.com/blogs/jimmy_bogard/archive/2009/01/04/10-things-to-embrace-in-2009.aspx\"\u003eclever list\u003c/a\u003e or my future plans. Sadly for the world, the clever bug has not bitten me in quite a while so it is stuck with my plans for the new year. As an added bonus, it\u0027s going to be a two parter!\u003c/p\u003e \r\n\u003ch3\u003eThe Book\u003c/h3\u003e \r\n\u003cp\u003eOver my Christmas break, I read \u003ca href=\"http://www.pragprog.com/titles/ahptl/pragmatic-thinking-and-learning\"\u003ePragmatic Thinking and Learning\u003c/a\u003e from the \u003ca href=\"http://www.pragprog.com/\"\u003ePragmatic Programmers\u003c/a\u003e. I was quite impressed with the ideas and how they were presented. In a nutshell (hah!), the book describes the human brain as having two modes: linear (L) and rich (R). (The &quot;L&quot; and the &quot;R&quot; correspond to the misnomer of a left and right brain) It describes how they function and how this relates to the ways in which software developers work. It goes on to recommend various actions that can be used to improve mental performance and awareness.\u003c/p\u003e \r\n\u003cp\u003eIn typical Brian Mavity (that\u0027s me) fashion, I became so highly motivated to start putting some these ideas into practice that I was ready to try about 30 of them at once. The phrase, &quot;Like a kid in a candy store,&quot; comes to mind. But when rereading the part of the book that I will discuss next, the recommendation was to focus on the one most important thing that I could do right now. (it\u0027s like it just knows... freaky!)\u003c/p\u003e \r\n\u003ch3\u003eA Focused Plan of Action\u003c/h3\u003e \r\n\u003cp\u003eBecause that advice is also in the spirit of being lean, I decided on developing a Pragmatic Investment Plan. A quick Google search will highlight that I am not the first person to have this idea, but the idea is so compelling that I am quite sure I will not be the last. That will likely be the topic of my next blog post. (Maybe I should change my blog title to &quot;Welcome to Snoozeville.&quot;)\u003c/p\u003e \r\n\u003ch3\u003eOk, Maybe Not\u003c/h3\u003e \r\n\u003cp\u003eUnfortunately, while I did identify the one next step, I couldn\u0027t just limit myself to one idea. I decided on including two more items that I feel will be very beneficial. Mind maps and morning writings.\u003c/p\u003e \r\n\u003cp\u003eMind maps are a type of visual outline that are drawn on unlined paper. They allow for a structured, yet extremely creative, arrangement of concepts and ideas. I have already created a couple of these, and my early impressions are positive. The way I arrange the items on the paper frees my mind to be creative in a way that a traditional outline would not. As a side note, mind maps are apparently extremely common in Europe while being almost non existent in the United States. Weird.\u003c/p\u003e \r\n\u003cp\u003eAnd finally, morning writings are a way to get ideas flowing before your linear mode kicks in. The premise is that if you write (not type) 3 pages a day just after you wake up, you will begin to express ideas that have been brewing in the rich mode of your brain. This means before coffee, before showering, before breakfast. First thing. I figure that I need practice writing, so any extra creativity will be a bonus. It\u0027ll be worth a shot.\u003c/p\u003e \r\n\u003ch3\u003eTwo Days in a Row! What\u0027s next?\u003c/h3\u003e \r\n\u003cp\u003eI hope everyone has had a great 2009 so far, and I look forward to providing you with some interesting content (at some point). If you\u0027re looking for a unique perspective on learning and creativity, I highly recommend Pragmatic Thinking and Learning. Keep an eye out for a detailed description of my Pragmatic Investment Plan and how I went about deciding on it. And remember, resolutions suck eggs.\u003c/p\u003e ","Title":"2009 Part 1 - Pragmatic Thinking and Learning","PublishDate":"1/9/2009"}
{"Author":"Brian Mavity","Content":"\u003cp\u003eIn my \u003ca href=\"http://www.brianmavity.com/blog/2009-part-1-pragmatic-thinking-and-learning/\"\u003eprevious blog post\u003c/a\u003e, I discussed the book \u003ca href=\"http://www.amazon.com/s/ref=nb_ss_gw_0_14?url=search-alias%3Daps&amp;field-keywords=pragmatic+thinking+and+learning&amp;x=0&amp;y=0&amp;sprefix=pragmatic+thin\"\u003ePragmatic Thinking and Learning\u003c/a\u003e from Andy Hunt of \u003ca href=\"http://www.pragprog.com/\"\u003ePragmatic Programmer\u003c/a\u003e fame. As part of the Pragmatic Programmer consulting practice, they present a concept called the Pragmatic Investment Plan (PIP), and a shortened version is outlined in the book. The idea is that you should treat your knowledge portfolio the same way you\u0027d treat your financial portfolio.\u003c/p\u003e \r\n\u003ch3\u003eSay What?\u003c/h3\u003e \r\n\u003cp\u003eIf you\u0027re investing your money, you do logical things like having a solid plan of action and diversifying your investments. You also want to keep track of your plans and tweak them when they need it. The same reasoning applies with your knowledge investment. You want to make sure that you have a concrete plan of what you\u0027re going to learn. You also need to make sure that you don\u0027t invest too heavily in one type of technology, say OOP when you could be doing some functional programming or only static languages when you could be learning how to program in a dynamic language. The best part about this is that no matter what you learn, it all has value. Even if you\u0027re not using something directly on your job, what you have learned still affects your thinking and therefore gives you a broadened perspective.\u003c/p\u003e \r\n\u003cp\u003eFor your PIP, make sure that you\u003c/p\u003e \r\n\u003cblockquote\u003e \r\n\u003cul\u003e \r\n    \u003cli\u003eHave a concrete plan.\u003c/li\u003e \r\n    \u003cli\u003eDiversify.\u003c/li\u003e \r\n    \u003cli\u003eMake an active, not passive, investment.\u003c/li\u003e \r\n    \u003cli\u003eMake a regular investment.\u003c/li\u003e \r\n\u003c/ul\u003e \r\n\u003c/blockquote\u003e \r\n\u003ch3\u003eBe SMART\u003c/h3\u003e \r\n\u003cp\u003eThe PIP is a higher level concept, and as such, it is purposefully vague about the details of making your investment. The book does give some guidance in the way of \u003ca href=\"http://en.wikipedia.org/wiki/SMART_(project_management)\"\u003eSMART Objectives\u003c/a\u003e. Using the book\u0027s definition, the acronym SMART stands for\u003c/p\u003e \r\n\u003cul\u003e \r\n    \u003cli\u003eSpecific\u003c/li\u003e \r\n    \u003cli\u003eMeasurable\u003c/li\u003e \r\n    \u003cli\u003eAchievable\u003c/li\u003e \r\n    \u003cli\u003eRelevant\u003c/li\u003e \r\n    \u003cli\u003eTime-Boxed\u003c/li\u003e \r\n\u003c/ul\u003e \r\n\u003cp\u003eJust stating a goal like &quot;Learning Haskell&quot; is not enough. Goals need to be better defined and broken down into smaller objectives. Each objective should have all of the properties shown above. By narrowing the focus of an objective to a well defined activity that you enjoy and giving yourself a deadline, you vastly increase the odds of actually achieving your goal.\u003c/p\u003e \r\n\u003ch3\u003eThe Power of Less\u003c/h3\u003e \r\n\u003cp\u003e\u003ca href=\"http://www.fourhourworkweek.com/blog/2009/01/07/the-power-of-less-leo-babauta-zen-habits/\"\u003eTim Ferriss\u003c/a\u003e recently posted a review of a book called \u003ca href=\"http://www.amazon.com/Power-Less-Limiting-Yourself-Essential/dp/1401309704/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1232690151&amp;sr=8-1\"\u003eThe Power of Less\u003c/a\u003e on his blog. An excerpt of Chapter 5 deals with successfully breaking habits. The author referred to a strategy he called &quot;The Power of Less Challenge&quot; which is focused on tackling one habit at a time.\u003c/p\u003e \r\n\u003cblockquote\u003e \r\n\u003cp\u003e1. Select one habit for the Challenge. Only \u003cstrong\u003eone habit per month\u003c/strong\u003e. You can choose any habit &mdash; whatever you think will have the biggest impact on your life.\u003c/p\u003e \r\n\u003cp\u003e2. Write down your plan. You will need to specifically state what your goal will be each day, when you&rsquo;ll do it, \u003cstrong\u003ewhat your &ldquo;trigger&rdquo; will be (the event that will immediately precede the habit that&rsquo;s already a part of your routine &mdash; such as exercising right after you brush your teeth)\u003c/strong\u003e, who you will report to (see below).\u003c/p\u003e \r\n\u003cp\u003e3. Post your goal publicly. Tell as many people as possible that you are trying to form your new habit. I suggest an online forum, but you could email it to coworkers and family and friends or otherwise get the word out to a large group.\u003c/p\u003e \r\n\u003cp\u003e4. Report on your progress daily. Each day, tell the same group of people whether or not you succeeded at your goal.\u003c/p\u003e \r\n\u003c/blockquote\u003e \r\n\u003cp\u003eI see some common themes between this, SMART, and the PIP. I think the key point to focus on here is to be specific with the activity you are trying to accomplish. When you couple that with a plan of action and small milestones, it creates a very effective combination.\u003c/p\u003e \r\n\u003ch3\u003eWhere do I go from here?\u003c/h3\u003e \r\n\u003cp\u003eWhile I do like the idea of being public about my habits and goals, I am not yet sure if I want to devote a section of my web site to daily progress. For the time being, I am going to say that would be overkill. In the future, if I feel like I am not making decent enough progress, I may employ that technique. In the meantime, I hope this post can be helpful to the people like me that sometimes have trouble focusing on specific activities for learning and end up expending their energies in many places at once.\u003c/p\u003e \r\n\u003cp\u003e\u003cstrong\u003eNote:\u003c/strong\u003e Since this post got too long, I didn\u0027t want to include my specific example. I will follow up with specific example no later than this weekend.\u003c/p\u003e","Title":"2009 Part 2 - Pragmatic Investment Plan","PublishDate":"1/23/2009"}
{"Author":"Brian Mavity","Content":"\u003cp\u003e\u003ca href=\"http://www.brianmavity.com/blog/2009-part-2-pragmatic-investment-plan/\"\u003ePreviously\u003c/a\u003e, I outlined what a Pragmatic Investment Plan (PIP) is and why it may be relevant to people who are looking for more structure in the way they going about learning and improving themselves. I feel strongly about including concrete examples to complement abstract descriptions, but since my last post was already a bit long, I decided that for the sake of anyone reading, my example would be have to be a separate post. The upside is that now I can provide some of the detail that needed to be cut in the interest of brevity.\u003c/p\u003e \r\n\u003ch3\u003ePragmatic Investment Plan\u003c/h3\u003e \r\n\u003cp\u003eA PIP, while never finished by definition, still has to have a first version. My initial PIP is not quite complete yet, but one of the goals it includes is learning \u003ca href=\"http://haskell.org/\"\u003eHaskell\u003c/a\u003e. You may be thinking, &quot;Wait, didn&rsquo;t you say in the last post that &quot;learning Haskell&quot; was not specific enough to be a goal?&quot; To that, I say to you, &quot;Good catch!&quot; My goal which involves Haskell is officially, &quot;I want to write a Haskell application which displays a GUI, accesses the file system, and uses a database.&quot; I&rsquo;ll address the five categories of my PIP as it relates to Haskell.\u003c/p\u003e \r\n\u003ch5\u003e\u003cstrong\u003eHave a concrete plan\u003c/strong\u003e\u003c/h5\u003e \r\n\u003cp\u003eI want to read all the chapters and complete all the coding examples in the \u003ca href=\"http://www.realworldhaskell.org/blog/\"\u003eReal World Haskell\u003c/a\u003e book, and participate in the \u003ca href=\"http://groups.google.com/group/real-world-haskell-book-club\"\u003eReal World Haskell Book Club\u003c/a\u003e every week.\u003c/p\u003e \r\n\u003ch5\u003e\u003cstrong\u003eDiversify\u003c/strong\u003e\u003c/h5\u003e \r\n\u003cp\u003eI have only programmed in \u003ca href=\"http://en.wikipedia.org/wiki/Object_oriented_programming\"\u003eObject Oriented\u003c/a\u003e or \u003ca href=\"http://en.wikipedia.org/wiki/Procedural_programming\"\u003eProcedural\u003c/a\u003e languages, so a \u003ca href=\"http://en.wikipedia.org/wiki/Functional_programming\"\u003eFunctional\u003c/a\u003e language will be a big mind shift.\u003c/p\u003e \r\n\u003ch5\u003e\u003cstrong\u003eMake an active, not passive, investment\u003c/strong\u003e\u003c/h5\u003e \r\n\u003cp\u003eI will monitor my progress and make sure that my end goal is still something I want to pursue.\u003c/p\u003e \r\n\u003ch5\u003eMake a regular investment\u003c/h5\u003e \r\n\u003cp\u003eThe book club meets every week and discusses a new chapter, so I will need to spend at least a couple of days every week following along with the book and programming.\u003c/p\u003e \r\n\u003ch3\u003eThe SMART Part\u003c/h3\u003e \r\n\u003cp\u003eMy first objective to achieve my goal is, &quot;I will read Chapters 3 and 4 of the Real World Haskell book and complete all the examples within those chapters.&quot; Notice that I am making a positive statement that provides a clear vision on what I am going to accomplish. I&rsquo;ll break this objective down as it relates to SMART and provide some additional analysis.\u003c/p\u003e \r\n\u003ch5\u003eSpecific\u003c/h5\u003e \r\n\u003cp\u003eThe objective contains no ambiguity. Being specific leads directly to being measurable.\u003c/p\u003e \r\n\u003ch5\u003eMeasurable\u003c/h5\u003e \r\n\u003cp\u003eThe objective is met if I finish these chapters. The result is obvious, which is exactly what is desired, because I need to know when I&rsquo;m done and that it&rsquo;s time to move on to my next objective.\u003c/p\u003e \r\n\u003ch5\u003eAchievable\u003c/h5\u003e \r\n\u003cp\u003eThe objective is something that is within my current capabilities. Ideally, it should have been something that pushed up against my limitations, because learning things that require new or more skillful activities will allow me to grow. This objective won&rsquo;t really stretch me that far, but I&rsquo;m ok with it, because we are still in the intro chapters. I am nominally familiar with functional programming concepts, although not Haskell in particular, and I have read that it gets harder very soon.\u003c/p\u003e \r\n\u003ch5\u003eRelevant\u003c/h5\u003e \r\n\u003cp\u003eHaskell, and functional programming, is different in a way that I find fascinating, and this is important because being interested and excited about an objective makes it much more likely to be completed.\u003c/p\u003e \r\n\u003ch5\u003eTime-Boxed\u003c/h5\u003e \r\n\u003cp\u003eBecause the Real World Haskell Book Club meets weekly, I have a week to finish each chapter. Having a deadline not only forces more action and less procrastination, it also gives the satisfaction of success. Repeated, small successes provide positive reinforcement and lead to bigger successes.\u003c/p\u003e \r\n\u003ch3\u003eA Piece of the Overall Plan\u003c/h3\u003e \r\n\u003cp\u003eA PIP should not (but can) be limited to a single goal and the goals should be spread across multiple areas of interest. Part of &quot;Diversify&quot; includes getting outside of your area of expertise. There are things that I have wanted to do for a long time that are not tech related (learning piano and learning Spanish are two of them) and they will likely be included in my PIP in the future.\u003c/p\u003e \r\n\u003cp\u003eWhat I like is that at its core, a Pragmatic Investment Plan is a guideline on defining goals and achieving them. It&rsquo;s an ongoing process that doesn&rsquo;t need to be perfect the first time. It&rsquo;s iterative, giving me the ability to focus on the short term and quickly change my tactics if something isn&rsquo;t working. I&rsquo;m excited to start on this journey, and if I&rsquo;ve piqued your interest, you should go ahead and dive in!\u003c/p\u003e","Title":"Pragmatic Investment Plan: An Example","PublishDate":"1/24/2009"}
{"Author":"Brian Mavity","Content":"\u003cp\u003eToday is Basecamp&rsquo;s 5th birthday. I am not a Basecamp user, but the birthday announcement spoke to me at a very deep level. The most powerful part of it for me was\u003c/p\u003e \r\n\u003cblockquote\u003eOne of the most rewarding things has been showing people that there&rsquo;s a different way, a better way. Software doesn&rsquo;t have to be a pain in the ass. Software doesn&rsquo;t have to get in the way. Software isn&rsquo;t about feature lists and sensational promises. Software is a concise set of tools that serve as an extension of your own mind. Great software lets you get things done and then it gets out of your way.\u003c/blockquote\u003e ","Title":"37signals Gets It In a Way That Most People Don\u0027t","PublishDate":"2/4/2009"}
{"Author":"Brian Mavity","Content":"\u003cp\u003eAlthough it was probably obvious from the fact that my hosting company did not pull the plug on my website, I did want to confirm that I am indeed not dead. I have been avoiding changing the theme of my blog because I want to write a simple blog engine using \u003ca href=\"http://fubumvc.pbworks.com/\"\u003eFubuMVC\u003c/a\u003e, but the \u003ca href=\"http://74.125.113.132/search?q=cache:_VFL4ltFMawJ:www.brianmavity.com/+brian+mavity&amp;cd=1&amp;hl=en&amp;ct=clnk&amp;gl=us\"\u003eugliness of the puzzle theme\u003c/a\u003e got to me before my coding skillz caught up.\u003c/p\u003e \r\n\u003cp\u003eSince my last post, I have attended \u003ca href=\"http://altnetseattle.pbworks.com/\"\u003ealt.net Seattle\u003c/a\u003e, \u003ca href=\"http://iowacodecamp.com/default.aspx\"\u003eIowa code camp\u003c/a\u003e, and \u003ca href=\"http://www.chicagocodecamp.com/\"\u003eChicago code camp\u003c/a\u003e. I got to hang out with a bunch of great people and I learned a bunch at all the events. I can&rsquo;t stress enough \u003ca href=\"http://www.brianmavity.com/blog/i-have-lost-my-virginity-and-you-should-too/\"\u003ehow important it is for developers to get out there and get exposed to different view points\u003c/a\u003e. My next &ldquo;appearance&rdquo; will be at \u003ca href=\"http://monospace.us/\"\u003eMonoSpace conf\u003c/a\u003e in October. I&rsquo;m extremely excited about it, and if you&rsquo;re headed there, feel free to leave a comment and we can meet up and grab a beer.\u003c/p\u003e \r\n\u003cp\u003eAs for coding, I have a handful of projects on the backburner. I am hoping that they will produce a steady stream of interesting blog posts, if not some interesting results. I don&rsquo;t want to jinx anything by being specific, but I will say that I&rsquo;m keeping my fingers crossed. ;)\u003c/p\u003e","Title":"I\u0027m not dead","PublishDate":"7/25/2009"}
{"Author":"Brian Mavity","Content":"\u003cp\u003eWhen I was younger lad, I would occasionally come home and complain about school. My dad used to tell me, &ldquo;Brian, there aren&rsquo;t boring subjects, just boring people.&rdquo; At the time I was mildly insulted and wrote him off as a crazy old kook, but ultimately it was something profound. I won&rsquo;t belabor the point, but even implementing a simple blog engine can not only be interesting, but can also provide ample opportunity for learning.\u003c/p\u003e \r\n\u003ch2\u003ePreamble or Pre-ramble?\u003c/h2\u003e \r\n\u003cp\u003eAlthough I am a software developer by trade, I moonlight as a user experience (UX) designer and &ldquo;do my best&rdquo; as a visual designer. I am a firm believer that UX is not something that can be &ldquo;added later,&rdquo; it is an essential part of any piece of successful software from the beginning. Even if a piece of software is profitable, it&rsquo;s not a true success unless it provides users with an enjoyable and rewarding experience. Bad experience conveys contempt for customers, and builds no loyalty. They&rsquo;ll jump ship as soon as something of equivalent functionality comes along.\u003c/p\u003e \r\n\u003cp\u003eTwo books, \u003ca href=\"http://gettingreal.37signals.com/toc.php\"\u003eGetting Real\u003c/a\u003e and \u003ca href=\"http://www.amazon.com/gp/product/0672326140\"\u003eInmates are Running the Asylum\u003c/a\u003e, lead me on the path to not only empathizing with and caring about the users of my applications, but also introduced me to my two biggest influences in software design: \u003ca href=\"http://37signals.com/\"\u003e37signals\u003c/a\u003e and \u003ca href=\"http://www.cooper.com/\"\u003eCooper\u003c/a\u003e. In this spirit, I am going to explore implementing a blog by bringing some UX and UI design basics into the forefront. Along the way, I&rsquo;ll introduce some technologies I am experimenting with, and detail some of my coding practices.\u003c/p\u003e \r\n\u003ch2\u003eInteresting implications\u003c/h2\u003e \r\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eKnow what you&rsquo;re building\u003c/em\u003e\u003c/strong\u003e. This is rule #0 for software. Have a purpose, a direction. A lot of blog &ldquo;features&rdquo; I notice provide little to no value to users, they are simply visual noise. Doing even a little bit of analysis beforehand allows a software designer to figure out the answers to these important questions:\u003c/p\u003e \r\n\u003cul\u003e \r\n    \u003cli\u003eWho are the users?\u003c/li\u003e \r\n    \u003cli\u003eWhat are their goals?\u003c/li\u003e \r\n    \u003cli\u003eWhat is the barest minimum amount of functionality necessary to meet basic goals?\u003c/li\u003e \r\n\u003c/ul\u003e \r\n\u003cp\u003eOnce those questions are answered, it&rsquo;s time to get the minimum functionality out in front of the users.\u003c/p\u003e \r\n\u003cp\u003eFrom \u003ca href=\"http://gettingreal.37signals.com/ch06_Race_to_Running_Software.php\"\u003eGetting Real\u003c/a\u003e:\u003c/p\u003e \r\n\u003cblockquote\u003e \r\n\u003cp\u003eWith real, running software everyone gets closer to true understanding and agreement. You avoid heated arguments over sketches and paragraphs that wind up turning out not to matter anyway. You realize that parts you thought were trivial are actually quite crucial.\u003c/p\u003e \r\n\u003cp\u003eReal things lead to real reactions. And that\u0027s how you get to the truth.\u003c/p\u003e \r\n\u003c/blockquote\u003e \r\n\u003cp\u003eNothing is more important.\u003c/p\u003e \r\n\u003ch2\u003eDon&rsquo;t leave me hangin&rsquo;\u003c/h2\u003e \r\n\u003cp\u003eMy goal is to replace \u003ca href=\"http://graffiticms.com/\"\u003eGraffiti\u003c/a\u003e as my blog engine as soon as possible and to provide additional high value enhancements one by one. To get started, I&rsquo;ll need to:\u003c/p\u003e \r\n\u003cul\u003e \r\n    \u003cli\u003eview blog posts\u003c/li\u003e \r\n    \u003cli\u003ereceive comments\u003c/li\u003e \r\n    \u003cli\u003egenerate Google friendly urls\u003c/li\u003e \r\n    \u003cli\u003epublish blog posts through Windows Live Writer\u003c/li\u003e \r\n\u003c/ul\u003e \r\n\u003cp\u003eYes, that&rsquo;s it. The workload is even smaller because I will continue to let the professionals over at \u003ca href=\"http://disqus.com/\"\u003edisqus\u003c/a\u003e handle my comments and I am going to start out using a \u003ca href=\"http://vasters.com/clemensv/PermaLink,guid,679ca50b-c907-4831-81c4-369ef7b85839.aspx\"\u003eprebuilt WCF implementation of the MetaWeblog API\u003c/a\u003e to allow me to publish posts through Windows Live Writer. It seems it should take me less time to implement the first release of the blog than it did to write this post. We shall see.\u003c/p\u003e ","Title":"Writing a Blog Engine: Boring? I think not.","PublishDate":"9/13/2009"}
{"Author":"Brian Mavity","Content":"\u003cp\u003eAs I mentioned previously, I have been interested in writing my own blog engine, mainly for the sake of learning some new technologies. I understand that prevailing wisdom is that writing a blog is boring and uninteresting work, but Rob Conery put a spin on it when he \u003ca href=\"http://blog.wekeroad.com/blog/be-a-good-jedi-build-your-own-blog/\"\u003einvited developers to write their own blog engines and use them as their resumes (or lightsabers).\u003c/a\u003e It has been 6 weeks since my last post, and although I have not yet made my first commit to a source control server, I have made, as one of my college physics professors used to say, &ldquo;fair to middlin&rsquo;&rdquo; progress.\u003c/p\u003e\r\n\r\n\u003ch3\u003eWhat seems to be the problem?\u003c/h3\u003e\r\n\r\n\u003cp\u003eIn a classic case of d&#0233;j&#0224; vu all over again, I decided that I was going to make this a &ldquo;real&rdquo; learning experience. By the time I sat down to dig into all the new things I&rsquo;d need to learn for this simple project, the list had become quite the spectacle. Let&rsquo;s see if I can remember all of the technologies I have spent at least 4 hours of time on in the past 6 weeks: \u003ca href=\"http://boo.codehaus.org/\"\u003eboo\u003c/a\u003e, \u003ca href=\"http://fubumvc.pbworks.com/\"\u003eFubuMVC\u003c/a\u003e, \u003ca href=\"http://sparkviewengine.com/\"\u003eSpark View Engine\u003c/a\u003e, \u003ca href=\"http://couchdb.apache.org/\"\u003eCouch DB\u003c/a\u003e, \u003ca href=\"http://storyteller.tigris.org/\"\u003eStoryTeller\u003c/a\u003e, \u003ca href=\"http://seleniumhq.org/projects/remote-control/\"\u003eSelenium\u003c/a\u003e, \u003ca href=\"http://www.mono-project.com/Main_Page\"\u003eMono\u003c/a\u003e, \u003ca href=\"http://monodevelop.com/\"\u003eMonoDevelop\u003c/a\u003e, \u003ca href=\"http://www.ubuntu.com/\"\u003eUbuntu\u003c/a\u003e, \u003ca href=\"http://www.icsharpcode.net/OpenSource/SD/\"\u003eSharpDevelop\u003c/a\u003e, and \u003ca href=\"http://www.db4o.com/\"\u003edb4o\u003c/a\u003e. Now consider the technologies I&rsquo;ll be using that I have had prior experience with: html, css, JavaScript, and \u003ca href=\"http://pivotallabs.com/users/nick/blog/articles/433-screw-unit-a-new-js-testing-framework-version-0-1\"\u003escrew-unit\u003c/a\u003e.\u003c/p\u003e\r\n\r\n\u003cp\u003eThe result was that I spent a significant percentage of my time learning 11 new technologies, and an infinitesimally small amount of time with the ones I knew. I fell prey to fact 6 in the \u003ca href=\"http://www.amazon.com/Facts-Fallacies-Software-Engineering-Robert/dp/0321117425\"\u003eFacts and Fallacies of Software Engineering\u003c/a\u003e.\u003c/p\u003e\r\n\r\n\u003cblockquote\u003e\r\n  \u003cp\u003eLearning a new tool or technique actually lowers programmer productivity and product quality initially. The eventual benefit is achieved only after this learning curve is overcome. Therefore, it is worth adopting new tools and techniques, but only (a) if their value is seen realistically and (b) if patience is used in measuring benefits.\u003c/p\u003e\r\n\u003c/blockquote\u003e\r\n\r\n\u003cp\u003eI barely scratched the surface of anything but FubuMVC and Spark, so while I did gain some knowledge, my productivity was essentially ground to a halt under the oppressive yoke of uncertainty.\u003c/p\u003e\r\n\r\n\u003ch3\u003eThat&rsquo;s not so bad, is it?\u003c/h3\u003e\r\n\r\n\u003cp\u003eThat list did not materialize overnight, each and every addition had a legitimate reason to be included. What&rsquo;s the harm? After all, I have a significant interest in learning all of those technologies, learning is a good thing, and good things are, well, \u003cem\u003egood\u003c/em\u003e. Right? Wrong. Know what&rsquo;s better than good? Great. You know what would be great? Actually delivering something! If I go by the only metric that really matters, \u003ca href=\"http://gettingreal.37signals.com/ch06_Done.php\"\u003eexecution\u003c/a\u003e, this blog project has been a spectacular failure up until this point.\u003c/p\u003e\r\n\r\n\u003cp\u003eI ended up getting so bogged down in all the learning, that I never got into a flow. More than one night ended in frustration when I didn&rsquo;t make any forward progress. When I did manage the occasionally herculean task of getting something to work, more often than not, I would be content to consider \u003cstrong\u003ethat\u003c/strong\u003e my victory for the evening and head off to bed. \u003c/p\u003e\r\n\r\n\u003ch3\u003eOut of the ashes\u003c/h3\u003e\r\n\r\n\u003cp\u003eAm I doomed to this life of never getting any of my fun projects \u003cstrike\u003estarted\u003c/strike\u003e finished? In an effort to answer this question in a positive manner, this past week has been a reevaluation of my priorities and a significant paring down of the shiny new toys. I am still going to use FubuMVC, Spark, StoryTeller, and Selenium. I have been using the latter two at work so they aren&rsquo;t going to impede my progress, but I am switching back to Visual Studio and c# for my coding and likely to SQL Server Expression for my data store. I now have very little that I&rsquo;ll have to fight conceptually, which should allow me to get things done (git r done?) and gain some momentum.\u003c/p\u003e\r\n\r\n\u003cp\u003eThe progress I have made so far does not include any code, but that&rsquo;s not the first step in producing a product. Most importantly, I have a \u003ca href=\"http://gettingreal.37signals.com/ch09_Interface_First.php\"\u003epreliminary UI design\u003c/a\u003e and a \u003ca href=\"http://gettingreal.37signals.com/ch02_Build_Less.php\"\u003esmall list of features\u003c/a\u003e that are required for me to begin using my blog engine for these posts. I have given myself an attainable goal and my brain is no longer scattered to the four corners of the earth. It is time to move forward.\u003c/p\u003e\r\n\r\n\u003ch3\u003eParting Words of Wisdom\u003c/h3\u003e\r\n\r\n\u003cp\u003eLearning for learning&rsquo;s sake is ok in small doses, but directed, focused learning used to reach a goal is like keeping a fine edge on your sword, even if it happens to be made of light.\u003c/p\u003e","Title":"Answering the Rob Conery Challenge","PublishDate":"9/4/2009"}
